INSERT INTO Client (FirstName, LastName, MiddleName, PassportData)
VALUES 
('Алексей', 'Иванов', 'Сергеевич', '1234 567890'),
('Мария', 'Смирнова', 'Игоревна', '5678 123456'),
('Ольга', 'Кузнецова', 'Андреевна', '8765 432109'),
('Дмитрий', 'Попов', 'Викторович', '3456 789012'),
('Анна', 'Лебедева', 'Александровна', '4321 987654'),
('Сергей', 'Новиков', 'Михайлович', '1234 876543'),
('Екатерина', 'Козлова', 'Николаевна', '6543 210987'),
('Иван', 'Морозов', 'Петрович', '9876 543210'),
('Татьяна', 'Петрова', 'Григорьевна', '3210 654321'),
('Максим', 'Соколов', 'Романович', '2109 876543'),
('Елена', 'Михайлова', 'Валерьевна', '4321 098765'),
('Андрей', 'Федоров', 'Борисович', '6543 219876'),
('Анастасия', 'Беляева', 'Аркадьевна', '7890 123456'),
('Владимир', 'Ковалев', 'Евгеньевич', '9012 345678'),
('Юлия', 'Гордеева', 'Вячеславовна', '5678 901234'),
('Александр', 'Захаров', 'Леонидович', '8765 432123'),
('Ирина', 'Волкова', 'Павловна', '3456 789543'),
('Олег', 'Зайцев', 'Тимофеевич', '7654 321098'),
('Светлана', 'Киселева', 'Дмитриевна', '2345 678901'),
('Роман', 'Соловьев', 'Константинович', '9876 543876'),
('Наталья', 'Васильева', 'Юрьевна', '8765 432098'),
('Павел', 'Павлов', 'Владимирович', '4321 654321'),
('Евгения', 'Голубева', 'Романовна', '5678 123432'),
('Виктор', 'Ильин', 'Васильевич', '3456 789210'),
('Кристина', 'Тихонова', 'Геннадьевна', '9012 345654'),
('Георгий', 'Крылов', 'Алексеевич', '2109 654321'),
('Дарья', 'Орлова', 'Ивановна', '7654 321765'),
('Константин', 'Марков', 'Петрович', '2345 678876'),
('Надежда', 'Фомина', 'Владимировна', '8765 432543'),
('Василий', 'Александров', 'Максимович', '5432 109876');


insert into Available(DateListed)
values
('2024-12-02'),
('2023-02-22'),
('2024-09-18');


INSERT INTO Reserved (ClientID, ReservedDate, ExpirationDate, InterestRate)
VALUES
(1, '2024-12-01', '2025-01-01', 5.00),
(2, '2024-12-03', '2025-02-01', 4.50),
(3, '2024-12-07', '2025-03-01', 6.00);

INSERT INTO Sold (ClientID, SaleDate)
VALUES
(1, '2024-12-01'),
(2, '2024-12-05'),
(3, '2024-12-10');

insert into ItemType (NameType)
values
('electronics'),
('watch'),
('expensive metal'),
('books'),
('archaeological item'),
('wine');

insert into Item(ItemName, ItemTypeID, Price, AvailableID, ReservedID, SoldID, Status)
values
('The Hero with a Thousand Faces', 4, 333.3, 1, null, null, 'Available'),
('IPhon21', 1, 9999.99, null, null, 3, 'Reserved'),
('Chateau Mouton Rothschild', 6, 200.2, null, 2, null, 'Sold');


select * from Available;
select * from Reserved;
select * from Sold;

select * from Item;

-- truncate table Item;